RTEMS/rtems/bsps/arm/imxrt/include/fsl_common.h
/*
 * Chip level peripheral reset API, for MCUs that implement peripheral reset control external to a peripheral
 */
#if ((defined(FSL_FEATURE_SOC_SYSCON_COUNT) && (FSL_FEATURE_SOC_SYSCON_COUNT > 0)) || \
     (defined(FSL_FEATURE_SOC_ASYNC_SYSCON_COUNT) && (FSL_FEATURE_SOC_ASYNC_SYSCON_COUNT > 0)))
#include "fsl_reset.h"
#endif

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
        extern "C"
{
#endif

    /*!
     * @brief Enable specific interrupt.
     *
     * Enable LEVEL1 interrupt. For some devices, there might be multiple interrupt
     * levels. For example, there are NVIC and intmux. Here the interrupts connected
     * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
     * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
     * to NVIC first then routed to core.
     *
     * This function only enables the LEVEL1 interrupts. The number of LEVEL1 interrupts
     * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
     *
     * @param interrupt The IRQ number.
     * @retval kStatus_Success Interrupt enabled successfully
     * @retval kStatus_Fail Failed to enable the interrupt
     */
    static inline status_t EnableIRQ(IRQn_Type interrupt)
    {
        if (NotAvail_IRQn == interrupt)
        {
            return kStatus_Fail;
        }

#if defined(FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS) && (FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0)
        if ((uint32_t)interrupt >= (uint32_t)FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS)
        {
            return kStatus_Fail;
        }
#endif

#if defined(__GIC_PRIO_BITS)
        GIC_EnableIRQ(interrupt);
#else
        NVIC_EnableIRQ(interrupt);
#endif
        return kStatus_Success;
    }

    /*!
     * @brief Disable specific interrupt.
     *
     * Disable LEVEL1 interrupt. For some devices, there might be multiple interrupt
     * levels. For example, there are NVIC and intmux. Here the interrupts connected
     * to NVIC are the LEVEL1 interrupts, because they are routed to the core directly.
     * The interrupts connected to intmux are the LEVEL2 interrupts, they are routed
     * to NVIC first then routed to core.
     *
     * This function only disables the LEVEL1 interrupts. The number of LEVEL1 interrupts
     * is indicated by the feature macro FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS.
     *
     * @param interrupt The IRQ number.
     * @retval kStatus_Success Interrupt disabled successfully
     * @retval kStatus_Fail Failed to disable the interrupt
     */
    static inline status_t DisableIRQ(IRQn_Type interrupt)
    {
        if (NotAvail_IRQn == interrupt)
        {
            return kStatus_Fail;
        }

#if defined(FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS) && (FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS > 0)
        if ((uint32_t)interrupt >= (uint32_t)FSL_FEATURE_NUMBER_OF_LEVEL1_INT_VECTORS)
        {
            return kStatus_Fail;
        }
#endif

#if defined(__GIC_PRIO_BITS)
        GIC_DisableIRQ(interrupt);
#else
    NVIC_DisableIRQ(interrupt);
#endif
        return kStatus_Success;
    }

    /*!
     * @brief Disable the global IRQ
     *
     * Disable the global interrupt and return the current primask register. User is required to provided the primask
     * register for the EnableGlobalIRQ().
     *
     * @return Current primask value.
     */
    static inline uint32_t DisableGlobalIRQ(void)
    {
#if defined (__XCC__)
        return 0;
#else
#if defined(CPSR_I_Msk)
        uint32_t cpsr = __get_CPSR() & CPSR_I_Msk;

        __disable_irq();

        return cpsr;
#else
    uint32_t regPrimask = __get_PRIMASK();

    __disable_irq();

    return regPrimask;
#endif
#endif
    }

    /*!
     * @brief Enable the global IRQ
     *
     * Set the primask register with the provided primask value but not just enable the primask. The idea is for the
     * convenience of integration of RTOS. some RTOS get its own management mechanism of primask. User is required to
     * use the EnableGlobalIRQ() and DisableGlobalIRQ() in pair.
     *
     * @param primask value of primask register to be restored. The primask value is supposed to be provided by the
     * DisableGlobalIRQ().
     */
    static inline void EnableGlobalIRQ(uint32_t primask)
    {
#if defined (__XCC__)
#else
#if defined(CPSR_I_Msk)
        __set_CPSR((__get_CPSR() & ~CPSR_I_Msk) | primask);
#else
    __set_PRIMASK(primask);
#endif
#endif
    }

#if defined(ENABLE_RAM_VECTOR_TABLE)
    /*!
     * @brief install IRQ handler
     *
     * @param irq IRQ number
     * @param irqHandler IRQ handler address
     * @return The old IRQ handler address
     */
    uint32_t InstallIRQHandler(IRQn_Type irq, uint32_t irqHandler);
#endif /* ENABLE_RAM_VECTOR_TABLE. */

#if (defined(FSL_FEATURE_SOC_SYSCON_COUNT) && (FSL_FEATURE_SOC_SYSCON_COUNT > 0))
    /*!
     * @brief Enable specific interrupt for wake-up from deep-sleep mode.
     *
     * Enable the interrupt for wake-up from deep sleep mode.
     * Some interrupts are typically used in sleep mode only and will not occur during
     * deep-sleep mode because relevant clocks are stopped. However, it is possible to enable
     * those clocks (significantly increasing power consumption in the reduced power mode),
     * making these wake-ups possible.
     *
     * @note This function also enables the interrupt in the NVIC (EnableIRQ() is called internaly).
     *
     * @param interrupt The IRQ number.
     */
    void EnableDeepSleepIRQ(IRQn_Type interrupt);

    /*!
     * @brief Disable specific interrupt for wake-up from deep-sleep mode.
     *
     * Disable the interrupt for wake-up from deep sleep mode.
     * Some interrupts are typically used in sleep mode only and will not occur during
     * deep-sleep mode because relevant clocks are stopped. However, it is possible to enable
     * those clocks (significantly increasing power consumption in the reduced power mode),
     * making these wake-ups possible.
     *
     * @note This function also disables the interrupt in the NVIC (DisableIRQ() is called internaly).
     *
     * @param interrupt The IRQ number.
     */
    void DisableDeepSleepIRQ(IRQn_Type interrupt);
#endif /* FSL_FEATURE_SOC_SYSCON_COUNT */

    /*!
     * @brief Allocate memory with given alignment and aligned size.
     *
     * This is provided to support the dynamically allocated memory
     * used in cache-able region.
     * @param size The length required to malloc.
     * @param alignbytes The alignment size.
     * @retval The allocated memory.
     */
    void *SDK_Malloc(size_t size, size_t alignbytes);

    /*!
     * @brief Free memory.
     *
     * @param ptr The memory to be release.
     */
    void SDK_Free(void *ptr);

    /*!
    * @brief Delay at least for some time.
    *  Please note that, this API uses while loop for delay, different run-time environments make the time not precise,
    *  if precise delay count was needed, please implement a new delay function with hardware timer.
    *
    * @param delay_us  Delay time in unit of microsecond.
    * @param coreClock_Hz  Core clock frequency with Hz.
    */
    void SDK_DelayAtLeastUs(uint32_t delay_us, uint32_t coreClock_Hz);

#ifdef __rtems__
/* Prototypes for IRQHandlers */
void FLEXIO_CommonIRQHandler(void);
void FLEXIO_DriverIRQHandler(void);
void FLEXIO0_DriverIRQHandler(void);
void FLEXIO1_DriverIRQHandler(void);
void UART2_FLEXIO_DriverIRQHandler(void);
void FLEXIO2_DriverIRQHandler(void);
void FLEXIO3_DriverIRQHandler(void);
void CAN0_DriverIRQHandler(void);
void CAN1_DriverIRQHandler(void);
void CAN2_DriverIRQHandler(void);
void CAN3_DriverIRQHandler(void);
void CAN4_DriverIRQHandler(void);
void DMA_FLEXCAN0_INT_DriverIRQHandler(void);
void DMA_FLEXCAN1_INT_DriverIRQHandler(void);
void DMA_FLEXCAN2_INT_DriverIRQHandler(void);
void ADMA_FLEXCAN0_INT_DriverIRQHandler(void);
void ADMA_FLEXCAN1_INT_DriverIRQHandler(void);
void ADMA_FLEXCAN2_INT_DriverIRQHandler(void);
void USDHC0_DriverIRQHandler(void);
void USDHC1_DriverIRQHandler(void);
void USDHC2_DriverIRQHandler(void);
void LPUART0_LPUART1_RX_DriverIRQHandler(void);
void LPUART0_LPUART1_TX_DriverIRQHandler(void);
void LPUART0_LPUART1_DriverIRQHandler(void);
void LPUART0_TX_DriverIRQHandler(void);
void LPUART0_RX_DriverIRQHandler(void);
void LPUART0_DriverIRQHandler(void);
void LPUART1_TX_DriverIRQHandler(void);
void LPUART1_RX_DriverIRQHandler(void);
void LPUART1_DriverIRQHandler(void);
void LPUART2_TX_DriverIRQHandler(void);
void LPUART2_RX_DriverIRQHandler(void);
void LPUART2_DriverIRQHandler(void);
void LPUART3_TX_DriverIRQHandler(void);
void LPUART3_RX_DriverIRQHandler(void);
void LPUART3_DriverIRQHandler(void);
void LPUART4_TX_DriverIRQHandler(void);
void LPUART4_RX_DriverIRQHandler(void);
void LPUART4_DriverIRQHandler(void);
void LPUART5_TX_DriverIRQHandler(void);
void LPUART5_RX_DriverIRQHandler(void);
void LPUART5_DriverIRQHandler(void);
void LPUART6_TX_DriverIRQHandler(void);
void LPUART6_RX_DriverIRQHandler(void);
void LPUART6_DriverIRQHandler(void);
void LPUART7_TX_DriverIRQHandler(void);
void LPUART7_RX_DriverIRQHandler(void);
void LPUART7_DriverIRQHandler(void);
void LPUART8_TX_DriverIRQHandler(void);
void LPUART8_RX_DriverIRQHandler(void);
void LPUART8_DriverIRQHandler(void);
void M4_0_LPUART_DriverIRQHandler(void);
void M4_1_LPUART_DriverIRQHandler(void);
void M4_LPUART_DriverIRQHandler(void);
void DMA_UART0_INT_DriverIRQHandler(void);
void DMA_UART1_INT_DriverIRQHandler(void);
void DMA_UART2_INT_DriverIRQHandler(void);
void DMA_UART3_INT_DriverIRQHandler(void);
void DMA_UART4_INT_DriverIRQHandler(void);
void ADMA_UART0_INT_DriverIRQHandler(void);
void ADMA_UART1_INT_DriverIRQHandler(void);
void ADMA_UART2_INT_DriverIRQHandler(void);
void ADMA_UART3_INT_DriverIRQHandler(void);
void DMA0_04_DriverIRQHandler(void);
void DMA0_15_DriverIRQHandler(void);
void DMA0_26_DriverIRQHandler(void);
void DMA0_37_DriverIRQHandler(void);
void DMA1_04_DriverIRQHandler(void);
void DMA1_15_DriverIRQHandler(void);
void DMA1_26_DriverIRQHandler(void);
void DMA1_37_DriverIRQHandler(void);
void DMA1_04_DriverIRQHandler(void);
void DMA1_15_DriverIRQHandler(void);
void DMA1_26_DriverIRQHandler(void);
void DMA1_37_DriverIRQHandler(void);
void DMA0_08_DriverIRQHandler(void);
void DMA0_19_DriverIRQHandler(void);
void DMA0_210_DriverIRQHandler(void);
void DMA0_311_DriverIRQHandler(void);
void DMA0_412_DriverIRQHandler(void);
void DMA0_513_DriverIRQHandler(void);
void DMA0_614_DriverIRQHandler(void);
void DMA0_715_DriverIRQHandler(void);
void DMA1_08_DriverIRQHandler(void);
void DMA1_19_DriverIRQHandler(void);
void DMA1_210_DriverIRQHandler(void);
void DMA1_311_DriverIRQHandler(void);
void DMA1_412_DriverIRQHandler(void);
void DMA1_513_DriverIRQHandler(void);
void DMA1_614_DriverIRQHandler(void);
void DMA1_715_DriverIRQHandler(void);
void DMA0_DMA16_DriverIRQHandler(void);
void DMA1_DMA17_DriverIRQHandler(void);
void DMA2_DMA18_DriverIRQHandler(void);
void DMA3_DMA19_DriverIRQHandler(void);
void DMA4_DMA20_DriverIRQHandler(void);
void DMA5_DMA21_DriverIRQHandler(void);
void DMA6_DMA22_DriverIRQHandler(void);
void DMA7_DMA23_DriverIRQHandler(void);
void DMA8_DMA24_DriverIRQHandler(void);
void DMA9_DMA25_DriverIRQHandler(void);
void DMA10_DMA26_DriverIRQHandler(void);
void DMA11_DMA27_DriverIRQHandler(void);
void DMA12_DMA28_DriverIRQHandler(void);
void DMA13_DMA29_DriverIRQHandler(void);
void DMA14_DMA30_DriverIRQHandler(void);
void DMA15_DMA31_DriverIRQHandler(void);
void DMA0_0_16_DriverIRQHandler(void);
void DMA0_1_17_DriverIRQHandler(void);
void DMA0_2_18_DriverIRQHandler(void);
void DMA0_3_19_DriverIRQHandler(void);
void DMA0_4_20_DriverIRQHandler(void);
void DMA0_5_21_DriverIRQHandler(void);
void DMA0_6_22_DriverIRQHandler(void);
void DMA0_7_23_DriverIRQHandler(void);
void DMA0_8_24_DriverIRQHandler(void);
void DMA0_9_25_DriverIRQHandler(void);
void DMA0_10_26_DriverIRQHandler(void);
void DMA0_11_27_DriverIRQHandler(void);
void DMA0_12_28_DriverIRQHandler(void);
void DMA0_13_29_DriverIRQHandler(void);
void DMA0_14_30_DriverIRQHandler(void);
void DMA0_15_31_DriverIRQHandler(void);
void DMA1_0_16_DriverIRQHandler(void);
void DMA1_1_17_DriverIRQHandler(void);
void DMA1_2_18_DriverIRQHandler(void);
void DMA1_3_19_DriverIRQHandler(void);
void DMA1_4_20_DriverIRQHandler(void);
void DMA1_5_21_DriverIRQHandler(void);
void DMA1_6_22_DriverIRQHandler(void);
void DMA1_7_23_DriverIRQHandler(void);
void DMA1_8_24_DriverIRQHandler(void);
void DMA1_9_25_DriverIRQHandler(void);
void DMA1_10_26_DriverIRQHandler(void);
void DMA1_11_27_DriverIRQHandler(void);
void DMA1_12_28_DriverIRQHandler(void);
void DMA1_13_29_DriverIRQHandler(void);
void DMA1_14_30_DriverIRQHandler(void);
void DMA1_15_31_DriverIRQHandler(void);
void DMA0_0_4_DriverIRQHandler(void);
void DMA0_1_5_DriverIRQHandler(void);
void DMA0_2_6_DriverIRQHandler(void);
void DMA0_3_7_DriverIRQHandler(void);
void DMA0_8_12_DriverIRQHandler(void);
void DMA0_9_13_DriverIRQHandler(void);
void DMA0_10_14_DriverIRQHandler(void);
void DMA0_11_15_DriverIRQHandler(void);
void DMA0_16_20_DriverIRQHandler(void);
void DMA0_17_21_DriverIRQHandler(void);
void DMA0_18_22_DriverIRQHandler(void);
void DMA0_19_23_DriverIRQHandler(void);
void DMA0_24_28_DriverIRQHandler(void);
void DMA0_25_29_DriverIRQHandler(void);
void DMA0_26_30_DriverIRQHandler(void);
void DMA0_27_31_DriverIRQHandler(void);
void DMA0_DriverIRQHandler(void);
void DMA1_DriverIRQHandler(void);
void DMA2_DriverIRQHandler(void);
void DMA3_DriverIRQHandler(void);
void DMA4_DriverIRQHandler(void);
void DMA5_DriverIRQHandler(void);
void DMA6_DriverIRQHandler(void);
void DMA7_DriverIRQHandler(void);
void DMA8_DriverIRQHandler(void);
void DMA9_DriverIRQHandler(void);
void DMA10_DriverIRQHandler(void);
void DMA11_DriverIRQHandler(void);
void DMA12_DriverIRQHandler(void);
void DMA13_DriverIRQHandler(void);
void DMA14_DriverIRQHandler(void);
void DMA15_DriverIRQHandler(void);
void DMA16_DriverIRQHandler(void);
void DMA17_DriverIRQHandler(void);
void DMA18_DriverIRQHandler(void);
void DMA19_DriverIRQHandler(void);
void DMA20_DriverIRQHandler(void);
void DMA21_DriverIRQHandler(void);
void DMA22_DriverIRQHandler(void);
void DMA23_DriverIRQHandler(void);
void DMA24_DriverIRQHandler(void);
void DMA25_DriverIRQHandler(void);
void DMA26_DriverIRQHandler(void);
void DMA27_DriverIRQHandler(void);
void DMA28_DriverIRQHandler(void);
void DMA29_DriverIRQHandler(void);
void DMA30_DriverIRQHandler(void);
void DMA31_DriverIRQHandler(void);
void ENET_Transmit_IRQHandler(void);
void ENET_Receive_IRQHandler(void);
void ENET_Error_IRQHandler(void);
void ENET_1588_Timer_IRQHandler(void);
void ENET_DriverIRQHandler(void);
void ENET1_DriverIRQHandler(void);
void ENET2_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_FRAME0_EVENT_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_FRAME1_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET0_FRAME2_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_FRAME0_EVENT_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_FRAME1_INT_DriverIRQHandler(void);
void CONNECTIVITY_ENET1_FRAME2_INT_DriverIRQHandler(void);
void ENET_1G_DriverIRQHandler(void);
void ENET_MAC0_Tx_Rx_Done_0_DriverIRQHandler(void);
void ENET_MAC0_Tx_Rx_Done_1_DriverIRQHandler(void);
void ENET_1G_1588_Timer_DriverIRQHandler(void);
void I2S0_DriverIRQHandler(void);
void I2S0_Tx_DriverIRQHandler(void);
void I2S0_Rx_DriverIRQHandler(void);
void I2S1_DriverIRQHandler(void);
void I2S1_Tx_DriverIRQHandler(void);
void I2S1_Rx_DriverIRQHandler(void);
void I2S2_DriverIRQHandler(void);
void I2S2_Tx_DriverIRQHandler(void);
void I2S2_Rx_DriverIRQHandler(void);
void I2S3_DriverIRQHandler(void);
void I2S3_Tx_DriverIRQHandler(void);
void I2S3_Rx_DriverIRQHandler(void);
void I2S4_DriverIRQHandler(void);
void I2S4_Tx_DriverIRQHandler(void);
void I2S4_Rx_DriverIRQHandler(void);
void I2S56_DriverIRQHandler(void);
void I2S56_Tx_DriverIRQHandler(void);
void I2S56_Rx_DriverIRQHandler(void);
void I2S5_DriverIRQHandler(void);
void I2S5_Tx_DriverIRQHandler(void);
void I2S5_Rx_DriverIRQHandler(void);
void I2S6_DriverIRQHandler(void);
void I2S6_Tx_DriverIRQHandler(void);
void I2S6_Rx_DriverIRQHandler(void);
void AUDIO_SAI0_INT_DriverIRQHandler(void);
void AUDIO_SAI1_INT_DriverIRQHandler(void);
void AUDIO_SAI2_INT_DriverIRQHandler(void);
void AUDIO_SAI3_INT_DriverIRQHandler(void);
void AUDIO_SAI6_INT_DriverIRQHandler(void);
void AUDIO_SAI7_INT_DriverIRQHandler(void);
void ADMA_SAI0_INT_DriverIRQHandler(void);
void ADMA_SAI1_INT_DriverIRQHandler(void);
void ADMA_SAI2_INT_DriverIRQHandler(void);
void ADMA_SAI3_INT_DriverIRQHandler(void);
void ADMA_SAI4_INT_DriverIRQHandler(void);
void ADMA_SAI5_INT_DriverIRQHandler(void);
void SAI0_DriverIRQHandler(void);
void SAI1_DriverIRQHandler(void);
void SAI2_DriverIRQHandler(void);
void SAI3_DriverIRQHandler(void);
void SAI3_TX_DriverIRQHandler(void);
void SAI3_RX_DriverIRQHandler(void);
void SAI4_DriverIRQHandler(void);
void SAI5_DriverIRQHandler(void);
void SAI6_DriverIRQHandler(void);
void FLEXSPI_DriverIRQHandler(void);
void FLEXSPI0_DriverIRQHandler(void);
void FLEXSPI1_DriverIRQHandler(void);
void LSIO_OCTASPI0_INT_DriverIRQHandler(void);
void LSIO_OCTASPI1_INT_DriverIRQHandler(void);
void FLEXSPI0_FLEXSPI1_DriverIRQHandler(void);
void LPSPI0_DriverIRQHandler(void);
void LPSPI1_DriverIRQHandler(void);
void LPSPI2_DriverIRQHandler(void);
void LPSPI3_DriverIRQHandler(void);
void LPSPI4_DriverIRQHandler(void);
void LPSPI5_DriverIRQHandler(void);
void DMA_SPI0_INT_DriverIRQHandler(void);
void DMA_SPI1_INT_DriverIRQHandler(void);
void DMA_SPI2_INT_DriverIRQHandler(void);
void DMA_SPI3_INT_DriverIRQHandler(void);
void ADMA_SPI0_INT_DriverIRQHandler(void);
void ADMA_SPI1_INT_DriverIRQHandler(void);
void ADMA_SPI2_INT_DriverIRQHandler(void);
void ADMA_SPI3_INT_DriverIRQHandler(void);
void CSI_DriverIRQHandler(void);
void CSI0_DriverIRQHandler(void);
void LPI2C0_DriverIRQHandler(void);
void LPI2C1_DriverIRQHandler(void);
void LPI2C2_DriverIRQHandler(void);
void LPI2C3_DriverIRQHandler(void);
void LPI2C4_DriverIRQHandler(void);
void LPI2C5_DriverIRQHandler(void);
void LPI2C6_DriverIRQHandler(void);
void M4_0_LPI2C_DriverIRQHandler(void);
void M4_LPI2C_DriverIRQHandler(void);
void M4_1_LPI2C_DriverIRQHandler(void);
void DMA_I2C0_INT_DriverIRQHandler(void);
void DMA_I2C1_INT_DriverIRQHandler(void);
void DMA_I2C2_INT_DriverIRQHandler(void);
void DMA_I2C3_INT_DriverIRQHandler(void);
void DMA_I2C4_INT_DriverIRQHandler(void);
void ADMA_I2C0_INT_DriverIRQHandler(void);
void ADMA_I2C1_INT_DriverIRQHandler(void);
void ADMA_I2C2_INT_DriverIRQHandler(void);
void ADMA_I2C3_INT_DriverIRQHandler(void);
void ADMA_I2C4_INT_DriverIRQHandler(void);
void SPDIF_DriverIRQHandler(void);
#endif /* __rtems__ */
#if defined(__cplusplus)
}
#endif

/*! @} */

#endif /* _FSL_COMMON_H_ */
